In [1]:
import pandas as pd
import numpy as np

In [3]:
g=pd.read_csv(r"C:\Users\Asus\OneDrive\Desktop\Python sem4\google_stock_price.csv")

In [4]:
g

            Date       Price
0     2004-08-19    2.490664
1     2004-08-20    2.515820
2     2004-08-23    2.758411
3     2004-08-24    2.770615
4     2004-08-25    2.614201
...          ...         ...
4788  2023-08-28  132.080002
4789  2023-08-29  132.998001
4790  2023-08-30  135.570007
4791  2023-08-31  137.050003
4792  2023-09-01  138.429993

[4793 rows x 2 columns]

In [5]:
g.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4793 entries, 0 to 4792
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4793 non-null   object
 1   Price   4793 non-null   float64
dtypes: float64(1), object(1)
memory usage: 75.0+ KB

In [5]:
g.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4793 entries, 0 to 4792
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4793 non-null   object
 1   Price   4793 non-null   float64
dtypes: float64(1), object(1)
memory usage: 75.0+ KB

In [6]:
g=pd.read_csv(r"C:\Users\Asus\OneDrive\Desktop\Python sem4\google_stock_price.csv",usecols=["Date"])

In [7]:
g

            Date
0     2004-08-19
1     2004-08-20
2     2004-08-23
3     2004-08-24
4     2004-08-25
...          ...
4788  2023-08-28
4789  2023-08-29
4790  2023-08-30
4791  2023-08-31
4792  2023-09-01

[4793 rows x 1 columns]

In [8]:
g=pd.read_csv(r"C:\Users\Asus\OneDrive\Desktop\Python sem4\google_stock_price.csv",usecols=["Date"]).squeeze("columns")

In [9]:
g

0       2004-08-19
1       2004-08-20
2       2004-08-23
3       2004-08-24
4       2004-08-25
           ...
4788    2023-08-28
4789    2023-08-29
4790    2023-08-30
4791    2023-08-31
4792    2023-09-01
Name: Date, Length: 4793, dtype: object